Documents/DMS_ВыдачаКартыЛояльности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>DMS_ВыдачаКартыЛояльности</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Renault_ОстаткиБаллов</xr:Item>
				<xr:Item>AccumulationRegister.DMS_БонусныеБаллы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.DMS_ВидыОперацийКартЛояльности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрограммаЛояльности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_ПрограммыЛояльности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.DMS_СтатусЗаменыКарт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказНаряд</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КартыПокупателей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КартаЛояльности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Renault_КартыЛояльности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номинал</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидКарты</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.DMS_ВидыКартЛояльности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПогаситьДо</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/DMS_БонусныеБаллы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>DMS_БонусныеБаллы</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Начислено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КСписанию</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.DMS_ВидыОперацийКартЛояльности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказНаряд</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>КартаЛояльности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_КартыЛояльности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПрограммаЛояльности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_ПрограммыЛояльности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/Renault_ОстаткиБаллов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>Renault_ОстаткиБаллов</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоБаллов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>КартаЛояльности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_КартыЛояльности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПогаситьДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/DMS_СтатусЗаменыКарт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>DMS_СтатусЗаменыКарт</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НаОзнакомлении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласован</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/DMS_ВидыОперацийКартЛояльности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>DMS_ВидыОперацийКартЛояльности</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗаменаДисконтнойКарты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаменаБонуснойКарты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеБаллов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеБаллов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеБалловРегламентно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаБонуснойКарты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаДисконтнойКарты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеБалловРегламентно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаменаКартыПриУтери</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратБаллов</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/DMS_ВыдачаКартыЛояльности/Ext/ObjectModule.bsl
Перем Права Экспорт;

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)	
	Префикс = DMS_ОбщегоНазначенияСервер.ПолучитьПрефикс();
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 
	
	Если Статус = Перечисления.DMS_СтатусЗаменыКарт.НаОзнакомлении Тогда
	
		Если РежимЗаписи = РежимЗаписиДокумента.Проведение
			И Проведен Тогда
		
			РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения;
			
		ИначеЕсли  РежимЗаписи = РежимЗаписиДокумента.Проведение
			И Не Проведен Тогда
		
			РежимЗаписи = РежимЗаписиДокумента.Запись;
			
		КонецЕсли; 
	
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)  	
	Если ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Статус 		  = Перечисления.DMS_СтатусЗаменыКарт.НаОзнакомлении;
	Ответственный = ПараметрыСеанса.Пользователь;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Статус 		  = Перечисления.DMS_СтатусЗаменыКарт.НаОзнакомлении;
	Ответственный = ПараметрыСеанса.Пользователь;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КартыКлиента.Ссылка.Дата КАК Период,
		|	КартыКлиента.Ссылка КАК Регистратор,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	КартыКлиента.Ссылка.Контрагент КАК Контрагент,
		|	КартыКлиента.Ссылка.ПрограммаЛояльности КАК ПрограммаЛояльности,
		|	КартыКлиента.КартаЛояльности КАК КартаЛояльности,
		|	КартыКлиента.Номинал КАК Начислено,
		|	0 КАК КСписанию,
		|	КартыКлиента.Ссылка.ВидОперации КАК ВидОперации
		|ИЗ
		|	Документ.DMS_ВыдачаКартыЛояльности.КартыПокупателей КАК КартыКлиента
		|ГДЕ
		|	КартыКлиента.Ссылка = &Ссылка
		|	И КартыКлиента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(перечисление.DMS_ВидыОперацийКартЛояльности.ВыдачаБонуснойКарты)
		|	И КартыКлиента.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.DMS_СтатусЗаменыКарт.Согласован)
		|	И КартыКлиента.Номинал > 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КартыКлиента.ПогаситьДо,
		|	КартыКлиента.Ссылка,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
		|	КартыКлиента.Ссылка.Контрагент,
		|	КартыКлиента.Ссылка.ПрограммаЛояльности,
		|	КартыКлиента.КартаЛояльности,
		|	0,
		|	КартыКлиента.Номинал,
		|	КартыКлиента.Ссылка.ВидОперации
		|ИЗ
		|	Документ.DMS_ВыдачаКартыЛояльности.КартыПокупателей КАК КартыКлиента
		|ГДЕ
		|	КартыКлиента.Ссылка = &Ссылка
		|	И КартыКлиента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(перечисление.DMS_ВидыОперацийКартЛояльности.ВыдачаБонуснойКарты)
		|	И КартыКлиента.ПогаситьДо <> ДАТАВРЕМЯ(1, 1, 1)
		|	И КартыКлиента.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.DMS_СтатусЗаменыКарт.Согласован)
		|	И КартыКлиента.Номинал > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КартыКлиента.Ссылка.Дата КАК Период,
		|	КартыКлиента.Ссылка КАК Регистратор,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	КартыКлиента.КартаЛояльности КАК КартаЛояльности,
		|	КартыКлиента.ПогаситьДо КАК ПогаситьДо,
		|	КартыКлиента.Номинал КАК КоличествоБаллов,
		|	КартыКлиента.Ссылка.ВидОперации КАК ВидОперации
		|ИЗ
		|	Документ.DMS_ВыдачаКартыЛояльности.КартыПокупателей КАК КартыКлиента
		|ГДЕ
		|	КартыКлиента.Ссылка = &Ссылка
		|	И КартыКлиента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(перечисление.DMS_ВидыОперацийКартЛояльности.ВыдачаБонуснойКарты)
		|	И КартыКлиента.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.DMS_СтатусЗаменыКарт.Согласован)
		|	И КартыКлиента.Номинал > 0";
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Движения.DMS_БонусныеБаллы.Записывать 	  = Истина;
	Движения.Renault_ОстаткиБаллов.Записывать = Истина;
	
	Движения.DMS_БонусныеБаллы.Загрузить(РезультатЗапроса[0].Выгрузить());	
	Движения.Renault_ОстаткиБаллов.Загрузить(РезультатЗапроса[1].Выгрузить());	
	
КонецПроцедуры

// Процедура удаляет из массива МассивРеквизитов элементы, соответствующие именам 
// реквизитов объекта из массива МассивНепроверяемыхРеквизитов.
// Для использования в обработчиках события ОбработкаПроверкиЗаполнения.
//
// Параметры:
//	МассивРеквизитов              - Массив - массив строк с именами реквизитов объекта.
//	МассивНепроверяемыхРеквизитов - Массив строк с именами реквизитов объекта, не требующих проверки.
//
Процедура УдалитьНепроверяемыеРеквизитыИзМассива(МассивРеквизитов, МассивНепроверяемыхРеквизитов) Экспорт
	
	Для Каждого ЭлементМассива Из МассивНепроверяемыхРеквизитов Цикл
	
		ПорядковыйНомер = МассивРеквизитов.Найти(ЭлементМассива);
		Если ПорядковыйНомер <> Неопределено Тогда
			МассивРеквизитов.Удалить(ПорядковыйНомер);
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры

#КонецЕсли
